var update = [{
    "version": "v2.5.0",
    "data": [
        "数据分析增加未知列表，即未找到新名字的数据"
    ],
    "issue": [
        "没有备份或者文件名恢复功能",
    ]
},
{
    "version": "v2.4.4",
    "data": [
        "修复退回页面出问题的错误",
        "代码增加更多注释",
        "文件表头存在重复关键字会报错"
    ],
    "issue": [
        "没有备份或者文件名恢复功能",
        "最后的数据分析里增加一个未在excel列表的里的名单"
    ]
},
{
    "version": "v2.4.3",
    "data": [
        "增加序号识别，序号默认不作为关键字",
        "修改使用手册，使其更清晰"
    ],
    "issue": [
        "没有备份或者文件名恢复功能",
        "excel列表有相同的关键字名称不能报错",
        "最后的数据分析里增加一个未在excel列表的里的名单"
    ]
},
{
    "version": "v2.4.2",
    "data": [
        "可以读取单列excel列表"
    ],
    "issue": [
        "表格里的序号默认不应作为关键字",
        "没有备份或者文件名恢复功能",
        "readme里没有增加快捷的下载链接",
        "excel列表有相同的表头不能报错",
        "最后的数据分析里增加一个未在excel列表的里的名单"
    ]
},
{
    "version": "v2.4.1",
    "data": [
        "修改提示，使其更清晰易懂",
        "增加开源许可证"
    ],
    "issue": [
        "不能读取单列excel列表",
        "excel列表有相同的表头不能报错"
    ]
},
{
    "version": "v2.4.0",
    "data": [
        "修改提示弹窗，更加美观，且无需按确定按钮",
        "修复不显示多交的问题",
        "修复分隔符默认不统一的情况",
        "新增回车快捷键，按回车可以代替点击提交按钮"
    ],
    "issue": [
        "不能读取单列excel列表",
        "excel列表有相同的表头不能报错"
    ]
},
{
    "version": "v2.3.2",
    "data": [
        "修复各种显示问题",
        "不能提交空的关键字"
    ],
    "issue": [
        "提示内容需要点击后才可进行下一步操作",
        "不能读取单列excel列表",
        "excel列表有相同的表头不能报错"
    ]
},
{
    "version": "v2.3.1",
    "data": [
        "增加统一分隔符动画，视觉上更连贯"
    ],
    "issue": [
        "提示内容需要点击后才可进行下一步操作"
    ]
},
{
    "version": "v2.3.0",
    "data": [
        "增加自定义选项",
        "增加自定义分隔符",
        "修复名字里包含多个空格但是只显示一个空格"
    ],
    "issue": [
        "动画生硬"
    ]
},
{
    "version": "v2.2.2",
    "data": [
        "调整样式",
        "增加图标"
    ],
    "issue": [
        "不能自定义选项",
        "不能自定义分隔符"
    ]
},
{
    "version": "v2.2.1",
    "data": [
        "微调样式"
    ],
    "issue": [
        "不能自定义选项",
        "不能自定义分隔符"
    ]
},
{
    "version": "v2.2.0",
    "data": [
        "改进页面样式",
        "去除手动选定分隔符",
        "修复当两个新名字相同时崩溃的问题"
    ],
    "issue": [
        "不能自定义选项",
        "不能自定义分隔符"
    ]
},
{
    "version": "v2.1.1",
    "data": [
        "增加使用手册及文档",
        "页面增加提示"
    ],
    "issue": [
        "界面丑陋",
        "不人性化，需要点击选定分隔符"
    ]
},
{
    "version": "v2.1.0",
    "data": [
        "增加数据合法性校验"
    ],
    "issue": [
        "界面丑陋",
        "没有文档，提示不完善",
        "不人性化，需要点击选定分隔符"
    ]
},
{
    "version": "v2.0.0",
    "data": [
        "推出用户图形界面",
        "可视化选择关键字",
        "可视化新旧名称对比"
    ],
    "issue": [
        "提交的参数没有合法性校验",
        "界面丑陋",
        "没有文档，提示不完善"
    ]
},
{
    "version": "v1.0.0",
    "data": [
        "做一个帮助一键格式化文件名称的程序",
        "推出黑框交互界面"
    ],
    "issue": [
        "界面不好看但是能用",
        "扩展功能不多"
    ]
}
];