var updata = [{
    "version": "v2.3.2",
    "data": [
        "修复各种显示问题",
        "不能提交空的关键字"
    ],
    "issue": [
        "提示内容需要点击后才可进行下一步操作",
        "不能读取单列excel列表",
        "excel列表有相同的表头不能报错"
    ]
}, 
{
    "version": "v2.3.1",
    "data": [
        "增加统一分隔符动画，视觉上更连贯"
    ],
    "issue": [
        "提示内容需要点击后才可进行下一步操作"
    ]
},
{
    "version": "v2.3.0",
    "data": [
        "增加自定义选项",
        "增加自定义分隔符",
        "修复名字里包含多个空格但是只显示一个空格"
    ],
    "issue": [
        "动画生硬"
    ]
},
{
    "version": "v2.2.2",
    "data": [
        "调整样式",
        "增加图标"
    ],
    "issue": [
        "不能自定义选项",
        "不能自定义分隔符"
    ]
},
{
    "version": "v2.2.1",
    "data": [
        "微调样式"
    ],
    "issue": [
        "不能自定义选项",
        "不能自定义分隔符"
    ]
},
{
    "version": "v2.2.0",
    "data": [
        "改进页面样式",
        "去除手动选定分隔符",
        "修复当两个新名字相同时崩溃的问题"
    ],
    "issue": [
        "不能自定义选项",
        "不能自定义分隔符"
    ]
},
{
    "version": "v2.1.1",
    "data": [
        "增加使用手册及文档",
        "页面增加提示"
    ],
    "issue": [
        "界面丑陋",
        "不人性化，需要点击选定分隔符"
    ]
},
{
    "version": "v2.1.0",
    "data": [
        "增加数据合法性校验"
    ],
    "issue": [
        "界面丑陋",
        "没有文档，提示不完善",
        "不人性化，需要点击选定分隔符"
    ]
},
{
    "version": "v2.0.0",
    "data": [
        "推出用户图形界面",
        "可视化选择关键字",
        "可视化新旧名称对比"
    ],
    "issue": [
        "提交的参数没有合法性校验",
        "界面丑陋",
        "没有文档，提示不完善"
    ]
},
{
    "version": "v1.0.0",
    "data": [
        "做一个帮助一键格式化文件名称的程序",
        "推出黑框交互界面"
    ],
    "issue": [
        "界面不好看但是能用",
        "扩展功能不多"
    ]
}
];